aaron-bond.better-comments
amazonwebservices.amazon-q-vscode
amazonwebservices.aws-toolkit-vscode
angular.ng-template
dracula-theme.theme-dracula
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
gdrtf.md2reader
github.copilot
github.copilot-chat
google.geminicodeassist
gruntfuggly.activitusbar
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cpptools
pkief.material-icon-theme
pmneo.tsimporter
quicktype.quicktype
saoudrizwan.claude-dev
steoates.autoimport
syncfusioninc.document-viewer-vscode-extensions
usernamehw.errorlens
